<a href="https://colab.research.google.com/github/alteregoxiv/stockpred/blob/main/stockprediction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

**Importing necessary libraries**

In [3]:
traindata = pd.read_csv("./AMZNtrain.csv")
traindata.head()

         Date        Open        High  ...       Close   Adj Close   Volume
0  2014-01-02  398.799988  399.359985  ...  397.970001  397.970001  2137800
1  2014-01-03  398.290009  402.709991  ...  396.440002  396.440002  2210200
2  2014-01-06  395.850006  397.000000  ...  393.630005  393.630005  3170600
3  2014-01-07  395.040009  398.470001  ...  398.029999  398.029999  1916000
4  2014-01-08  398.470001  403.000000  ...  401.920013  401.920013  2316500

[5 rows x 7 columns]

**Training data set**

In [4]:
testdata = pd.read_csv("./AMZNtest.csv")
testdata.head()

         Date         Open         High  ...        Close    Adj Close   Volume
0  2019-01-02  1465.199951  1553.359985  ...  1539.130005  1539.130005  7983100
1  2019-01-03  1520.010010  1538.000000  ...  1500.280029  1500.280029  6975600
2  2019-01-04  1530.000000  1594.000000  ...  1575.390015  1575.390015  9182600
3  2019-01-07  1602.310059  1634.560059  ...  1629.510010  1629.510010  7993200
4  2019-01-08  1664.689941  1676.609985  ...  1656.579956  1656.579956  8881400

[5 rows x 7 columns]

**Test data set**